nxp-mcuxpresso/mcux-soc-svd/MCXW70AD/MCXW70AD.xml
        <register>
          <name>PHY_CTRL</name>
          <description>PHY CONTROL (PHY_CTRL)PHY Control Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x807FF00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XCVSEQ</name>
              <description>802.15.4 Transceiver Sequence Selector The Transceiver Sequence Selector register selects an autosequence for the sequence manager to execute. Sequence initiation can be immediate, or scheduled (see TMRTRIGEN). A write of XCVSEQ=IDLE will abort any ongoing sequence. A write of XCVSEQ=IDLE must always be performed after a sequence is complete, and before a new sequence is programmed. Any write to XCVSEQ other than XCVSEQ=IDLE during an ongoing sequence, shall be ignored. The mapping of XCVSEQ to sequence types is as follows: 0x0,I (IDLE), 0x1,R (RECEIVE), 0x2,T (TRANSMIT), 0x3,C (CCA), 0x4,TR (TRANSMIT/RECEIVE), 0x5,CCCA (CONTINUOUS CCA), 0x6,Reserved, 0x7,Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXACKRQD</name>
              <description>Receive Acknowledge Frame required Applies only to Sequence TR, ignored during all other sequences. 0x0,An ordinary receive frame (any type of frame) follows the transmit, frame. 0x1,A receive Ack frame is expected to follow the transmit frame, (non-Ack frames are rejected).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCABFRTX</name>
              <description>CCA Before TX Applies only to Sequences T and TR, ignored during all other sequences. 0x0,no CCA required, transmit operation begins immediately., 0x1,at least one CCA measurement is required prior to the transmit, operation (see also SLOTTED).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOTTED</name>
              <description>Slotted Mode Slotted Mode, for beacon-enabled networks. Applies only to Sequences T, TR, and R, ignored during all other sequences. Used, in concert with CCABFRTX, to determine how many CCA measurements are required prior to a transmit operation. Also used during R sequence to determine whether the ensuing transmit acknowledge frame (if any) needs to be synchronized to a backoff slot boundary.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TMRTRIGEN</name>
              <description>Timer2 Trigger Enable 0x0,programmed sequence initiates immediately upon write to XCVSEQ., 0x1,allow timer TC2 (or TC2') to initiate a preprogrammed sequence (see, XCVSEQ register).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQMSK</name>
              <description>Sequencer Interrupt Mask 0x0,allows completion of an autosequence to generate a zigbee interrupt, 0x1,Completion of an autosequence will set the SEQIRQ status bit, but a, zigbee interrupt is not generated</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXMSK</name>
              <description>TX Interrupt Mask 0x0,allows completion of a TX operation to generate a zigbee interrupt, 0x1,Completion of a TX operation will set the TXIRQ status bit, but a, zigbee interrupt is not generated</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXMSK</name>
              <description>RX Interrupt Mask 0x0,allows completion of a RX operation to generate a zigbee interrupt, 0x1,Completion of a RX operation will set the RXIRQ status bit, but a, zigbee interrupt is not generated</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCAMSK</name>
              <description>CCA Interrupt Mask CCA Interrupt Mask 0x0,allows completion of a CCA operation to generate a zigbee interrupt, 0x1,Completion of a CCA operation will set the CCA status bit, but a, zigbee interrupt is not generated</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_WMRK_MSK</name>
              <description>RX Watermark Interrupt Mask RX Watermark Interrupt Mask 0x0,allows a Received Byte Count match to the RX_WTR_MARK threshold, register to generate a zigbee interrupt 0x1,A Received Byte Count match to the RX_WTR_MARK threshold register, will set the RXWTRMRKIRQ status bit, but a zigbee interrupt is not generated</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTERFAIL_MSK</name>
              <description>FilterFail Interrupt Mask FilterFail Interrupt Mask 0x0,allows Packet Processor Filtering Failure to generate a zigbee interrupt, 0x1,A Packet Processor Filtering Failure will set the FILTERFAIL_IRQ, status bit, but a zigbee interrupt is not generated</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_UNLOCK_MSK</name>
              <description>PLL Unlock Interrupt Mask 0x0,allows PLL unlock event to generate a zigbee interrupt, 0x1,A PLL unlock event will set the PLL_UNLOCK_IRQ status bit, but a, zigbee interrupt is not generated</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC_MSK</name>
              <description>CRC Mask CRC Mask 0x0,sequence manager ignores CRCVALID and considers the receive, operation complete after the last octet of the frame has been received. 0x1,sequence manager requires CRCVALID=1 at the end of the received, frame in order for the receive operation to complete successfully; if CRCVALID=0, sequence manager will return to preamble-detect mode after the last octet of the frame has been received.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKE_MSK</name>
              <description>Mask wakeup from DSM 0x0,Allows a wakeup from DSM to generate a zigbee interrupt, 0x1,Wakeup from DSM will set the WAKE_IRQ status bit, but a zigbee, interrupt is not generated</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARB_GRANT_DEASSERTION_MSK</name>
              <description>arb_grant Deassertion Interrupt Mask 0x0,allows arb_grant deassertion event to generate a zigbee interrupt, 0x1,An arb_grant deassertion event will set the, ARB_GRANT_DEASSERTION_IRQ status bit, but a zigbee interrupt is not generated</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_MSK</name>
              <description>Mask generating interrupt from TSM 0x0,allows assertion of a TSM interrupt to generate a zigbee interrupt, 0x1,Assertion of a TSM interrupt will set the TSM_IRQ status bit, but a, zigbee interrupt is not generated</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TMR1CMP_EN</name>
              <description>Timer 1 Compare Enable 0x0,Don't allow an Event Timer Match to T1CMP to set TMR1IRQ, 0x1,Allow an Event Timer Match to T1CMP to set TMR1IRQ</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TMR2CMP_EN</name>
              <description>Timer 2 Compare Enable 0x0,Don't allow an Event Timer Match to T2CMP or T2PRIMECMP to set TMR2IRQ, 0x1,Allow an Event Timer Match to T2CMP or T2PRIMECMP to set TMR2IRQ</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TMR3CMP_EN</name>
              <description>Timer 3 Compare Enable 0x0,Don't allow an Event Timer Match to T3CMP to set TMR3IRQ, 0x1,Allow an Event Timer Match to T3CMP to set TMR3IRQ</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TMR4CMP_EN</name>
              <description>Timer 4 Compare Enable 0x0,Don't allow an Event Timer Match to T4CMP to set TMR4IRQ, 0x1,Allow an Event Timer Match to T4CMP to set TMR4IRQ</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TC2PRIME_EN</name>
              <description>Timer 2 Prime Compare Enable 0x0,Don't allow a match of the lower 16 bits of Event Timer to, T2PRIMECMP to set TMR2IRQ 0x1,Allow a match of the lower 16 bits of Event Timer to T2PRIMECMP to, set TMR2IRQ</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TC3_POSTPONE_ON_SFD</name>
              <description>Postpone TC3 Timeout On SFD Enable If this bit is set, if a TMR3 timeout occurs while a packet is being received ( rx_sfd_detect = 1), the timeout-related abort will be deferred until the packet reception is completed. If the packet is good, HW will signal Data Indication; otherwise the 802.15.4 ZSM (Sequence Manager) will return to SEQ_IDLE and await further commanding. 0x0,TC3 Abort will occur on TMR3 timeout, regardless of rx_sfd_detect, 0x1,TC3 Abort will be deferred on TMR3 timeout if rx_sfd_detect is, asserted; otherwise the TC3 Abort will occur immediately</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCATYPE</name>
              <description>Clear Channel Assessment Type Clear Channel Assessment Type. Selects one of four possible functions for CCA or Energy Detect, per below. 0x0,ENERGY DETECT, 0x1,CCA MODE 1, 0x2,CCA MODE 2, 0x3,CCA MODE 3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TC3TMOUT</name>
              <description>TMR3 Timeout Enable TMR3 Timeout Enable 0x0,TMR3 is a software timer only, 0x1,Enable TMR3 to abort Rx or CCCA operations.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRCV_MSK</name>
              <description>Transceiver Global Interrupt Mask Transceiver Global Interrupt Mask 0x0,Enable any unmasked interrupt source to assert zigbee interrupt, 0x1,Mask all interrupt sources from asserting zigbee interrupt</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENT_TMR</name>
          <description>EVENT TIMER (EVENT_TMR)</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EVENT_TMR_FRAC</name>
              <description>Event Timer Fractional Component The EVENT_TMR represents a 32-bit number with 28 Integer bits and 4 Fractional bits. This field is the fractional component, which appears to the right of the decimal point. The fractional component can be ignored for most 802.15.4 operations which relate to the Event Timer; it has been provided only to allow for microsecond accuracy when software updates the Event Timer after a long period of DSM (sleep) mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EVENT_TMR</name>
              <description>Event Timer Integer Component The EVENT_TMR represents a 32-bit number with 28 Integer bits and 4 Fractional bits. This field is the integer component, which appears to the left of the decimal point. Most 802.15.4 operations which relate to the Event Timer require only the integer component.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMESTAMP</name>
          <description>TIMESTAMP (TIMESTAMP)</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIMESTAMP_FRAC</name>
              <description>Timestamp Fractional Holds the latched value of the fractional portion of the Event Timer current time corresponding to the beginning of the most recently received packet, at the point of SFD detection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMESTAMP</name>
              <description>Timestamp Holds the latched value of the integer portion of the Event Timer current time corresponding to the beginning of the most recently received packet, at the point of SFD detection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T1CMP</name>
          <description>T1 COMPARE (T1CMP)TMR1 Compare Value</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>T1CMP</name>
              <description>TMR1 Compare Value TMR1 compare value. If TMR1CMP_EN=1 and the Event Timer matches this value, TMR1IRQ is set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T2CMP</name>
          <description>T2 COMPARE (T2CMP)TMR2 Compare Value</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>T2CMP</name>
              <description>TMR2 Compare Value TMR2 compare value. If TMR2CMP_EN=1 and TC2PRIME_EN=0 and the Event Timer matches this value, TMR2IRQ is set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T2PRIMECMP</name>
          <description>T2 PRIME COMPARE (T2PRIMECMP)TMR2 Prime Compare Value</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>T2PRIMECMP</name>
              <description>TMR2 Prime Compare Value TMR2 compare value. If TMR2CMP_EN=1 and TC2PRIME_EN=1 and the Event Timer matches this value, TMR2IRQ is set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T3CMP</name>
          <description>T3 COMPARE (T3CMP)TMR3 Compare Value</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>T3CMP</name>
              <description>TMR3 Compare Value TMR3 compare value. If TMR3CMP_EN=1 and the Event Timer matches this value, TMR3IRQ is set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T4CMP</name>
          <description>T4 COMPARE (T4CMP)TMR4 Compare Value</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>T4CMP</name>
              <description>TMR4 Compare Value TMR4 compare value. If TMR4CMP_EN=1 and the Event Timer matches this value, TMR4IRQ is set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_PWR</name>
          <description>PA POWER (PA_PWR)</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PA_PWR</name>
              <description>PA Power</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT_PA_PWR</name>
              <description>External PA Power When transmitting and grant has been asserted, if zfdbk_txpower_ind asserts, then zfdbk_tx_power[5:0] is assigned to PA_PWR[6:1] and the status bit EXT_PA_PWR_CHG is set for software to check later. The value recorded in EXT_PA_PWR[6:0] is {zfdbk_tx_power[5:0],PA_PWR[0]} for debug purposes.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXT_PA_PWR_CHG</name>
              <description>External PA Power Change Flag THis flag is asserted when zfdbk_txpower_ind asserts during transmitting and grant has been asserted. This is write a '1' to clear bit.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHANNEL_NUM0</name>
          <description>CHANNEL NUMBER 0 (CHANNEL_NUM0)Channel Number for PAN0</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x12</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHANNEL_NUM0</name>
              <description>Channel Number for PAN0 This is the mapped channel number used to transmit and receive Zigbee packets. If Dual PAN is engaged, this register applies to PAN0. CHANNEL_NUM0 should be in the range: 11 &lt;= CHANNEL_NUM0 &lt;= 26</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEMP_MACSHORTADDRS0</name>
              <description>TEMPORARY MAC SHORT ADDRESS for PAN0 DURING TRANSITION FROM CHILD TO PARENT AND VICE-VERSA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEMP_SHORTADDRS_EN0</name>
              <description>When asserted Packet Processor will accept the packets with MACSHORTADDRS0 and TEMP_MACSHORTADDRS0 during transition of the device. When de-asserted Packet Processor will accept only the packets with MACSHORTADDRS0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
