nxp-mcuxpresso/mcux-soc-svd/MCXW70AD/MCXW70AD.xml
        <register>
          <name>LQI_AND_RSSI</name>
          <description>LQI AND RSSI (LQI_AND_RSSI)</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LQI_VALUE</name>
              <description>LQI Value Link Quality Indicator for the most recently received packet. (LQI is also available in the Packet Buffer, at the end of the received packet data)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSSI</name>
              <description>RSSI Value Received Signal Strength Indicator, in dBm</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCA1_ED_FNL</name>
              <description>Final Result for CCA Mode 1 and Energy Detect Output register to show final averaged RSSI value or compensated value of the same at the end of a CCA Mode1 or Energy Detect computation.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSSI_CCA_CONT</name>
              <description>This field is read only and never used in WCS FFU Instantiation. It will always read back zero value.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACSHORTADDRS0</name>
          <description>MAC SHORT ADDRESS 0 (MACSHORTADDRS0)MAC SHORT ADDRESS for PAN0</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACPANID0</name>
              <description>MAC PAN ID for PAN0 MAC PAN ID for PAN0. The packet processor compares the incoming packet's Destination PAN ID against the contents of this register to determine if the packet is addressed to this device; or if the incoming packet is a Beacon frame, the packet processor compares the incoming packet Source PAN ID against this register. Also, if PANCORDNTR0=1, and the incoming packet has no Destination Address field, and if the incoming packet is a Data or MAC Command frame, the packet processor compares the incoming packet Source PAN ID against this register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MACSHORTADDRS0</name>
              <description>MAC SHORT ADDRESS FOR PAN0 MAC Short Address for PAN0, for 16-bit destination addressing mode. The packet processor compares the incoming packet's Destination Address against the contents of this register to determine if the packet is addressed to this device.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACLONGADDRS0_LSB</name>
          <description>MAC LONG ADDRESS 0 LSB (MACLONGADDRS0_LSB)MAC LONG ADDRESS for PAN0 LSB</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACLONGADDRS0_LSB</name>
              <description>MAC LONG ADDRESS for PAN0 LSB MAC Long Address for PAN0, for 64-bit destination addressing mode. The packet processor compares the incoming packet's Destination Address against the contents of this register to determine if the packet is addressed to this device.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACLONGADDRS0_MSB</name>
          <description>MAC LONG ADDRESS 0 MSB (MACLONGADDRS0_MSB)MAC LONG ADDRESS for PAN0 MSB</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACLONGADDRS0_MSB</name>
              <description>MAC LONG ADDRESS for PAN0 MSB MAC Long Address for PAN0, for 64-bit destination addressing mode. The packet processor compares the incoming packet's Destination Address against the contents of this register to determine if the packet is addressed to this device.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_FRAME_FILTER</name>
          <description>RECEIVE FRAME FILTER (RX_FRAME_FILTER)RECEIVE FRAME FILTER</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x30F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BEACON_FT</name>
              <description>Beacon Frame Type Enable 0x0,reject all Beacon frames, 0x1,Beacon frame type enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_FT</name>
              <description>Data Frame Type Enable 0x0,reject all Data frames, 0x1,Data frame type enabled.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACK_FT</name>
              <description>Ack Frame Type Enable 0x0,reject all Acknowledge frames, 0x1,Acknowledge frame type enabled.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_FT</name>
              <description>MAC Command Frame Type Enable 0x0,reject all MAC Command frames, 0x1,MAC Command frame type enabled.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LLDN_FT</name>
              <description>LLDN Frame Type Enable 0x0,reject all LLDN frames, 0x1,LLDN frame type enabled (Frame Type 4).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MULTIPURPOSE_FT</name>
              <description>Multipurpose Frame Type Enable 0x0,reject all Multipurpose frames, 0x1,Multipurpose frame type enabled (Frame Type 5).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NS_FT</name>
              <description>Not Specified Frame Type Enable This bit enables reception of all Frame Types not covered by the other _FT bits in this register. 0x0,reject all Not Specified frames, 0x1,Not-specified (reserved) frame type enabled. Applies to Frame Type, 6. No packet filtering is performed, except for frame length checking (FrameLength&gt;=5 and FrameLength&lt;=127). No AUTOACK is transmitted for this Frame Type</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTENDED_FT</name>
              <description>Extended Frame Type Enable 0x0,reject all Extended frames, 0x1,Extended frame type enabled (Frame Type 7).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRM_VER_FILTER</name>
              <description>Frame Version selector. The incoming packet's Frame Control Field is parsed to obtain the FrameVersion subfield, and that value is compared against this register, in accordance with the following: xxx1: Accept received packets with FrameVersion=00 xx1x: Accept received packets with FrameVersion=01 x1xx: Accept received packets with FrameVersion=10 1xxx: Accept received packets with FrameVersion=11 These filtering rules apply to Beacon, Acknowledge, Data, and MAC Command Frame Types, since these frame types require a 2-octet Frame Control Field which embeds a 2-bit FrameVersion subfield. Later frame types introduced in the 802.15.4e addendum (LLDN, Multipurpose) don't guarantee a FrameVersion subfield with the original meaning, so these filtering rules do not apply to these frame types. See registers LLDN_FT and MULTIPURPOSE_FT. For Acknowledge frames, FrameVersion bits are ignored by the Packet Processor, irrespective of FRM_VER_FILTER.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FV2_ALLOW_BCD_TYPE_FOR_PP</name>
              <description>Enable packet_processor filter check on pp_filterfail_code0/1 for FV2, FrameType Beacon/CMD/DATA if 1'b1 : pp_filterail_code0/1 enabled for FV2, PacketType Beacon/Cmd/Data if 1'b0 (default) pp_filterfail_code0/1 are forced zero (for FV2)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTENDED_FCS_CHK</name>
              <description>Verify FCS on Frame Type Extended 0x0,Packet Processor will not check FCS for Frame Type EXTENDED (default), 0x1,Packet Processor will check FCS at end-of-packet based on packet, length derived from PHR, for Frame Type EXTENDED</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FV2_BEACON_RECD</name>
              <description>Frame Version 2 Beacon Packet Received 0x0,The last packet received was not Frame Type Beacon with Frame Version 2, 0x1,The last packet received was Frame Type Beacon with Frame Version 2 and FRM_VER_FILTER[2]=1 to allow such packets</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FV2_DATA_RECD</name>
              <description>Frame Version 2 Data Packet Received 0x0,The last packet received was not Frame Type Data with Frame Version 2, 0x1,The last packet received was Frame Type Data with Frame Version 2 and FRM_VER_FILTER[2]=1 to allow such packets</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FV2_ACK_RECD</name>
              <description>Frame Version 2 Acknowledge Packet Received 0x0,The last packet received was not Frame Type Ack with Frame Version 2, 0x1,The last packet received was Frame Type Ack with Frame Version 2 and FRM_VER_FILTER[2]=1 to allow such packets</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FV2_CMD_RECD</name>
              <description>Frame Version 2 MAC Command Packet Received 0x0,The last packet received was not Frame Type MAC Command with Frame, Version 2 0x1,The last packet received was Frame Type MAC Command with Frame, Version 2, and FRM_VER_FILTER[2]=1 to allow such packets</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LLDN_RECD</name>
              <description>LLDN Packet Received 0x0,The last packet received was not Frame Type LLDN, 0x1,The last packet received was Frame Type LLDN, and LLDN_FT=1 to allow, such packets.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULTIPURPOSE_RECD</name>
              <description>Multipurpose Packet Received 0x0,last packet received was not Frame Type MULTIPURPOSE, 0x1,The last packet received was Frame Type MULTIPURPOSE, and, MULTIPURPOSE_FT=1 to allow such packets.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTENDED_RECD</name>
              <description>Extended Packet Received 0x0,The last packet received was not Frame Type EXTENDED, 0x1,The last packet received was Frame Type EXTENDED, and EXTENDED_FT=1, to allow such packets.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PROMISCUOUS</name>
              <description>Promiscuous Mode Enable (PAN0) Bypasses most packet filtering. 0x0,normal mode, 0x1,all packet filtering except frame length checking (FrameLength&gt;=5, and FrameLength&lt;=127) is bypassed.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACTIVE_PROMISCUOUS</name>
              <description>Active Promiscuous (PAN0) 0x0,normal operation, 0x1,Provide Data Indication on all received packets under the same rules, which apply in PROMISCUOUS mode, however acknowledge those packets under rules which apply in non-PROMISCUOUS mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTOACK</name>
              <description>Auto Acknowledge Enable (PAN0) Applies only to Sequence R and Sequence TR, ignored during other sequences 0x0,sequence manager will not follow a receive frame with a Tx Ack, frame, under any conditions; the autosequence will terminate after the receive frame. 0x1,sequence manager will follow a receive frame with an automatic, hardware-generated Tx Ack frame, assuming other necessary conditions are met.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PANCORDNTR0</name>
              <description>Device is a PAN Coordinator on PAN0 Device is a PAN Coordinator on PAN0. Allows device to receive packets with no destination address, if Source PAN ID matches.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROMISCUOUS_PAN1</name>
              <description>Promiscuous Mode Enable (PAN1)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACTIVE_PROMISCUOUS_PAN1</name>
              <description>Active Promiscuous Mode Enable (PAN1)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTOACK_PAN1</name>
              <description>Auto Acknowledge Enable (PAN1)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PANCORDNTR1</name>
              <description>Device is a PAN Coordinator on PAN1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCA_LQI_CTRL</name>
          <description>CCA AND LQI CONTROL (CCA_LQI_CTRL)</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x866004B</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCA1_THRESH</name>
              <description>CCA Mode 1 Threshold Programmable energy threshold register for CCA mode 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LQI_OFFSET_COMP</name>
              <description>LQI Offset Compensation Programmable amount to offset RSSI based LQI value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIMUL_CCA_RX</name>
              <description>Simultaneous CCA and Receive Enable During autosequences of type Sequence T or Sequence TR with CCA before TX, this bit allows a packet to be received if preamble and SFD are detected during the CCA measurement window. 0x0,Packets can't be received during CCA measurement, 0x1,Packet reception is enabled during CCA measurement if preamble and, SFD are detected</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCA3_AND_NOT_OR</name>
              <description>CCA Mode 3 AND not OR Determines the way CCA3 is required to be detected 0x0,CCA1 or CCA2, 0x1,CCA1 and CCA2</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CONT_RSSI_EN</name>
              <description>This is a function not used in WCS FFU Instantiation</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCA2_CTRL</name>
          <description>CCA2 CONTROL (CCA2_CTRL)CCA Mode 2 Control in Link Layer. This register provides control for CCA Mode 2 Correlation Threshold and Correlation Peaks related settings</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8230</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCA2_NUM_CORR_PEAKS</name>
              <description>CCA Mode 2 Number of Correlation Peaks Detected Counts of number of peaks that crossed CCA2_CORR_THRESH in CCA Mode 2 operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCA2_MIN_NUM_CORR_TH</name>
              <description>CCA Mode 2 Threshold Number of Correlation Peaks Programmable threshold to be compared against number of correlation peaks that exceeded CCA2_CORR_THRESH for detecting CCA mode 2. Number of peaks detected = CCA2_MIN_NUM_CORR_TH + 1; Example: If it is programmed to 3, CCA2 logic looks for at least 4 correlation peaks that crossed the threshold, to indicate channel is idle or busy.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCA2_CORR_THRESH</name>
              <description>CCA Mode 2 Correlation Threshold Correlator threshold used to qualify correlator peaks counted by CCA2_NUM_CORR_PEAKS. Correlator peaks exceeding this value increment CCA2_NUM_CORR_PEAKS.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSM_CTRL</name>
          <description>DSM CONTROL (DSM_CTRL)</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ZIGBEE_SLEEP_REQUEST</name>
              <description>802.15.4 Deep Sleep Mode Request for Manual DSM If 802.15.4 is assigned to Manual DSM (XCVR_CTRL[MAN_DSM_SEL] = 1), setting ZIGBEE_SLEEP_REQUEST to 1 enables Deep Sleep Mode (DSM) to be entered when the RFMC TIMER matches the WOR ENTER_TIME register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BSM_CTRL</name>
          <description>BSM CONTROL (BSM_CTRL)</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BSM_EN</name>
              <description>Enable Bit Stream Mode Controller</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
