nxp-mcuxpresso/mcux-soc-svd/MCXW70AD/MCXW70AD.xml
        <register>
          <name>ENH_FEATURE</name>
          <description>ENHANCED FEATURES</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GENLL_MODE</name>
              <description>Link layer Mode Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GENLL_MODE0</name>
                  <description>GLL Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GENLL_MODE1</name>
                  <description>PAN Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GENLL_MODE2</name>
                  <description>FAN Mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GENLL_MODE3</name>
                  <description>Hybrid Dual PAN Mode</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GENLL_MODE6</name>
                  <description>FCP Mode</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GENLL_MODE9</name>
                  <description>Bluetooth LE Uncoded Mode</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GENLL_MODE10</name>
                  <description>Bluetooth LE LR Mode</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GENLL_MODE11</name>
                  <description>Bluetooth LE Concurrent Mode (RX configuration only; TX uses either Bluetooth LE UNCODED or Bluetooth LE LR configuration)</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GENLL_MODE15</name>
                  <description>GTM Mode</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL_RXIRQ</name>
              <description>Select the RX IRQ assert time</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>RX_IRQ is asserted at the end of RX_PKT state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>RX_IRQ is asserted at the end of RXEN_DLY state. This to be used for delaying RX_IRQ to accept TERM2 bits in Bluetooth LE-LR and CTE bits as needed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATARATE_CONFIG_SEL</name>
              <description>Select the data rate configuration bank</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Select the data rate as per configuration bank 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>Select the data rate as per configuration bank 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STAY_IN_RX</name>
              <description>Stay in receive</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Link layer will warm-down after an RX_IRQ</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>Link layer will recycle and stay in receive even after an RX_IRQ.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHR_TYPE</name>
              <description>PHR Type</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GFSK</name>
                  <description>The packet type is GFSK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSK</name>
                  <description>The packet type is MSK</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUNFSK</name>
                  <description>The packet type is SUN FSK</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LECIMFSK</name>
                  <description>The packet type is LECIM FSK</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW_BUILD_ACK</name>
              <description>Software builds the ACK packet in RAM</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Hardware builds part of or the whole of the auto ACK frame</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>Software builds the whole auto ACK frame in RAM.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACKBUF_SEL</name>
              <description>ACK frame is in 64-byte dedicated RAM or TX buffer RAM</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>ACK frame is in 64-byte dedicated RAM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>ACK frame is in TX buffer RAM</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTOACK</name>
              <description>Auto Acknowledge Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUTOACK_0</name>
                  <description>sequence manager will not follow a receive frame with a Tx Ack frame, under any conditions; the auto-sequence will terminate after the receive frame.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTOACK_1</name>
                  <description>sequence manager will follow a receive frame with an automatic hardware-generated Tx Ack frame, assuming other necessary conditions are met.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXACKRQD</name>
              <description>Receive Acknowledge Frame required</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXACKRQD_0</name>
                  <description>An ordinary receive frame (any type of frame) follows the transmit frame.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXACKRQD_1</name>
                  <description>A receive Ack frame is expected to follow the transmit frame (non-Ack frames are rejected).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLOTTED</name>
              <description>Slotted Mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LENGTH_ACK</name>
              <description>Length of the ACK frame(or part of the ACK frame) in RAM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE_V5P1_CTE_EN</name>
              <description>Bluetooth LE version 5.1 CTE feature enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLE_V5P1_CTE_EN_0</name>
                  <description>Do not support Bluetooth LE version 5.1 CTE feature.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLE_V5P1_CTE_EN_1</name>
                  <description>Support Bluetooth LE version 5.1 CTE feature, which means the link layer hardware can parse the CTE field length and extend the RX_EN signal accordingly.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
