nxp-mcuxpresso/mcux-soc-svd/MCXW70AD/MCXW70AD.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>BLE2</name>
      <description>ble2</description>
      <groupName>BLE2_REG</groupName>
      <baseAddress>0x40110000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE84</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ble_reg_txrx_ccm_session_key_0</name>
          <description>Session Key 0 for CCM Operation</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ccm_key</name>
              <description>CCM Session Key ([31:0] of 128-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_txrx_ccm_session_key_1</name>
          <description>Session Key 1 for CCM Operation</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ccm_key</name>
              <description>CCM Session Key ([63:32] of 128-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_txrx_ccm_session_key_2</name>
          <description>Session Key 2 for CCM Operation</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ccm_key</name>
              <description>CCM Session Key ([95:64] of 128-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_txrx_ccm_session_key_3</name>
          <description>Session Key 3 for CCM Operation</description>
          <addressOffset>0x20C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ccm_key</name>
              <description>CCM Session Key ([127:96] of 128-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_txrx_ccm_init_vec_0</name>
          <description>Initialization Vector 0 for CCM Operation</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ccm_iv</name>
              <description>CCM Initialization Vector ([31:0] of 64-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_txrx_ccm_init_vec_1</name>
          <description>Initialization Vector 1 for CCM Operation</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ccm_iv</name>
              <description>CCM Initialization Vector ([63:32] of 64-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_tx_ccm_pkt_cnt_0</name>
          <description>Transmit CCM Packet Count 0</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_pkt_cnt</name>
              <description>Tx Packet Count ([31:0] of 39-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_tx_ccm_pkt_cnt_1</name>
          <description>Transmit CCM Packet Count 1</description>
          <addressOffset>0x21C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_pkt_cnt</name>
              <description>Tx Packet Count ([38:32] of 39-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_rx_ccm_pkt_cnt_0</name>
          <description>Receive CCM Packet Count 0</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_pkt_cnt</name>
              <description>Rx Packet Count ([31:0] of 39-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_rx_ccm_pkt_cnt_1</name>
          <description>Receive CCM Packet Count 1</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_pkt_cnt</name>
              <description>Rx Packet Count ([38:32] of 39-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_txrx_cntrl</name>
          <description>Transmit/Receive Packet Control</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>conn_event_role</name>
              <description>Connection event Role, 0x0: slave, 0x1: master</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>data_chan_pkt</name>
              <description>Channel to Distinguish pkt_header Fields, 0x0: advt channel, 0x1: data channel</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_data_rate</name>
              <description>LE Rx Packet Data Rate, 0x0: Rx packet data rate 1 Mbps, 0x1: Rx packet data rate 2 Mbps</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_data_rate</name>
              <description>LE Tx Packet Data Rate, 0x0: Tx packet data rate 1 Mbps, 0x1: Tx packet data rate 2 Mbps</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>data_length_ext</name>
              <description>LE Data Length Extension. Should be 0 when iso_pdu_sel is 1, 0x0: disable; support up to 31 bytes of payload for data channel PDU, 0x1: enable; support up to 255 bytes; or 251 bytes for encryption packet; of payload, for data channel PDU</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>advt_length_ext</name>
              <description>LE Advertising Length Extension. Should be 0 when iso_pdu_sel is 1, 0x0: disable; support up to 37 bytes of payload for advertising channel PDU, 0x1: enable; support up to 255 bytes of payload for advertising channel PDU</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>iso_pdu_sel</name>
              <description>Select ISO PDU type, 0x0: data_chan_pkt=0 selects Data PDU. data_chan_pkt=1 selects Adv PDU, 0x1: data_chan_pkt=0 selects BIS PDU. data_chan_pkt=1 selects CIS PDU</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>direct_test_mode</name>
              <description>BLE direct test mode, 0x0: BLE in normal mode, 0x1: BLE in direct test mode (bypass Rx packet length &lt; 6 check in adv mode)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>channel_index</name>
              <description>Channel Index Value for Whitening Initialization</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_extn_en</name>
              <description>Tx Extension Packet, Tx Extension Packet, 0x0: transmit data extension; regular; non-location BLE transmit packet, 0x1: transmit data extension; transmit extension field for current packet</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>whit_dis</name>
              <description>Disable Whitening, 0x0: enable, 0x1: disable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_length_max</name>
              <description>Maximum Length for rx_length_err, - For Advt Channel: 37 (if advt_length_ext = 0) or 255 (if advt_length_ext = 1)., - For Data Channel: 31 (if data_length_ext = 0 and ccm_en_rx = 0) or, 27 (if data_length_ext = 0 and ccm_en_rx = 1) or, 255 (if data_length_ext = 1 and ccm_en_rx = 0) or, 251 (if data_length_ext = 1 and ccm_en_rx = 1).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_extn_length</name>
              <description>Tx Extension Length for Tx DFE Packet, Length of extension field to be transmitted. This value is in the unit of 8 usec time frame and includes the guard period (for example; spec defined 1~4 usec) between CRC and the antenna switching part of extension., This bit is valid only when tx_extn_en is set.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_rf_agc_index</name>
              <description>BRF Rx Power Control Index, BRF Rx power control setting that is programmed into the BRF_RX_PKT_STATUS[7:5] register., These index bits are taken effect only when RIF register BTU_RIF_CTL0[1] is set.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_txrx_crc_init_val</name>
          <description>CRC Initialization Value</description>
          <addressOffset>0x22C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>crc_init_value</name>
              <description>CRC Initialization Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_tx_acc_addr</name>
          <description>Tx Access Address; for Advt and Data Packets</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_access_address</name>
              <description>Access Address for Tx Packet</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_rx_pkt_status</name>
          <description>Rx Packet Status; for Advt and Data Packets</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_pkt_header</name>
              <description>Rx Packet PDU Header</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_extn_suppl_info</name>
              <description>Rx Packet Supplemental Info Byte if available</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>simul_scan_coded_en</name>
              <description>Detected Rx Coded Packet Correlation Hit in Simultaneous Scan Mode, 0x0: Detected BLE 1M Packet Correlation Hit or no correlation at all in Simultaneous, Scan Mode, 0x1: Detected Rx Coded Packet Correlation Hit in Simultaneous Scan Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_preamble_match_sts</name>
              <description>Detected Rx Preamble Match during BLE Long Range RX, 0x0: Preamble has not been detected on most recent RX in long range mode., 0x1: Preamble has been detected on most recent RX in long range mode. This indication, resets at the start of next RX</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_rx_coded_pkt_indic_sts</name>
              <description>Coding Indicator (CI) value received during BLE Long Range RX. This field indicates the, coding rate of the FEC Block 2 of the LR Rx packet and is valid from rx_hdr_done_intr till start of next Rx packet, 0x0: FEC Block 2 coded using S=8., 0x1: FEC Block 2 coded using S=2.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>adv_addr_not_present</name>
              <description>This bit indicates if advertiser address is present or absent for each advertising packet received, 0x0: Advertiser address is present in extended advertising packet received; or, received packet is a legacy advertising packet, 0x1: Advertiser address is not present in extended advertising packet received</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_rx_cntrl</name>
          <description>Receive Packet Control</description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_cntrl_length_max</name>
              <description>Maximum Control PDU Length for rx_length_err, This is the length of max length Control PDUs., This field is used only if rx_cntrl_length_max_sel is set to 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_cntrl_length_max_sel</name>
              <description>Select Length Check Register for Control PDUs, 0x0: select rx_length_max for control PDU length check, 0x1: select rx_cntrl_length_max for control PDU length check</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reuse_rx_adv_addr_done_intr</name>
              <description>Allow reuse of rx_adv_addr_done_intr for indicating the absence of advertiser address in the received advertising channel PDU, 0x0: rx_adv_addr_done_intr = 1 for legacy and extended advertising channel packets, received with advertiser address rx_adv_addr_done_intr = 0 for extended, advertising channel packets received without advertiser address, 0x1: rx_adv_addr_done_intr = 1 for legacy and extended advertising channel packets, with advertiser address and extended advertising channel , packets received without advertiser address (in conjunction with, adv_addr_not_present)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_txrx_ccm_cntrl</name>
          <description>CCM Operation (encryption/authentication) Control</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ccm_en_tx</name>
              <description>CCM (Encryption/Authentication) Enable for Tx packet</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ccm_en_rx</name>
              <description>CCM (Encryption/Authentication) Enable for Rx packet</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>auth_disable_tx</name>
              <description>When ccm_en_tx = 1; setting 1 for CCM Enable for Tx Packet with encryption only and no authentication.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>auth_disable_rx</name>
              <description>When ccm_en_rx = 1; setting 1 for CCM Enable for Rx Packet with encryption only and no authentication.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>inc_tx_pkt_cnt</name>
              <description>Increment Tx CCM Packet Count, For each new Tx packet; writing 1 will increment the value in BLE_REG_TX_CCM_PKT_CNT_0/1 registers by 1. This bit is self-cleared by hardware.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
            </field>
            <field>
              <name>inc_rx_pkt_cnt</name>
              <description>Increment Rx CCM Packet Count, For each new Rx packet; writing 1 will increment the value in BLE_REG_RX_CCM_PKT_CNT_0/1 registers by 1. This bit is self-cleared by hardware.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_txrx_corhit_qus_timestamp</name>
          <description>Quarter microsecond level timestamp</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>corhit_timestamp_qus</name>
              <description>QUS level timestamp, This QUS timestamp is updated at correlation hit interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_txrx_corhit_mcclock_timestamp</name>
          <description>Native clock timestamp</description>
          <addressOffset>0x25C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>corhit_timestamp_clock</name>
              <description>Native clock value timestamp, Lower 28 bits are same as BTC native clock. Upper 4 bits are carry from BTC native clock wraps. This timestamp is updated at correlation hit interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
