nxp-mcuxpresso/mcux-soc-svd/MCXW70AD/MCXW70AD.xml
        <register>
          <name>ble_reg_tmr_cdt_ci_rx_data_adj_3</name>
          <description>Qus Count Offset Register: LE Coded Rx 3</description>
          <addressOffset>0x894</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_ci_2_adj_value</name>
              <description>Rx Count Down Value in QUS, +/- offset. Resolution: 0/25 us</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ci_2_adj_sign</name>
              <description>Rx Operation Sign, 0x0: add, 0x1: substrate</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ci_8_adj_value</name>
              <description>Rx Count Down Value in QUS, +/- offset. Resolution: 0/25 us</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ci_8_adj_sign</name>
              <description>Rx Operation Sign, 0x0: add, 0x1: substrate</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ci_adj_emask</name>
              <description>Adjustment Mask: Rx, Last coded bursting bit size for triggering this Rx adjustment.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_tmr_cdt_ci_rx_data_adj_4</name>
          <description>Qus Count Offset Register: LE Coded Rx 4</description>
          <addressOffset>0x898</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_ci_2_adj_value</name>
              <description>Rx Count Down Value in QUS, +/- offset. Resolution: 0/25 us</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ci_2_adj_sign</name>
              <description>Rx Operation Sign, 0x0: add, 0x1: substrate</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ci_8_adj_value</name>
              <description>Rx Count Down Value in QUS, +/- offset. Resolution: 0/25 us</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ci_8_adj_sign</name>
              <description>Rx Operation Sign, 0x0: add, 0x1: substrate</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ci_adj_emask</name>
              <description>Adjustment Mask: Rx, Last coded bursting bit size for triggering this Rx adjustment.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_tmr_cdt_sts</name>
          <description>Countdown timer Status</description>
          <addressOffset>0x89C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>cdt_expiry_sts</name>
              <description>CDT Expiry Status in CDT Matching mode, This bit is updated at each CDT expiry; when CDT is programmed in cdt_matching_mode. For the purpose of this register; past value on CDT refers to any value less than the half-slot+qus timestamp at which CDT was programmed. Once set it remains set until this CDT expires again in the matching mode, 0x0: CDT matching was successful, 0x1: CDT matching value was in the past at the time of programming</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_ant_switch_tx_cntrl</name>
          <description>Tx Antenna Switch Control, Control register of Bluetooth Tx antenna switching.</description>
          <addressOffset>0x900</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x12424</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_ant_switch_delay_1m</name>
              <description>Antenna Switch Delay from end of Tx Crc, Timer delayed from end of CRC of the current Tx packet to start driving requestAntenna to signal BCA which antenna is used for the Tx extension field., - Resolution: 0.25 usec.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_delay_2m</name>
              <description>Antenna Switch Delay from end of Tx Crc, Timer delayed from end of CRC of the current Tx packet to start driving requestAntenna to signal BCA which antenna is used for the Tx extension field. This delay is for BLE Tx 2 Mbps., - Resolution: 0.25 usec.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_map_length</name>
              <description>Antenna Switch Map Length for Tx DFE, - Valid length of Tx antenna map pattern (max: 40). After executing the antenna switching for this length; BLE will repeat the pattern from the beginning. The map is used when BLE is transmitting extension packets.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_rate</name>
              <description>Antenna Switch Rate, Define the antenna switching rate for extension packet., 0x0: switch antenna every 4 usec, 0x1: switch antenna every 2 usec, 0x2: switch antenna every 1 usec (RFU), 0x3: not valid</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ref_ant</name>
              <description>BCA reference antenna, The value of reference antenna held by the BCA.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_ant_switch_en</name>
              <description>Antenna Switch Enable for Tx DFE, Switch antenna for extension when transmitting location packet., 0x0: disable antenna switch for Tx DFE, 0x1: enable antenna switch for Tx DFE</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_ant_switch_tx_map_0</name>
          <description>Tx Antenna Switch Map: Map 0</description>
          <addressOffset>0x904</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_ant_switch_index_0</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_1</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_2</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_3</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_ant_switch_tx_map_1</name>
          <description>Tx Antenna Switch Map: Map 1</description>
          <addressOffset>0x908</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_ant_switch_index_0</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_1</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_2</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_3</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_ant_switch_tx_map_2</name>
          <description>Tx Antenna Switch Map: Map 2</description>
          <addressOffset>0x90C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_ant_switch_index_0</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_1</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_2</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_3</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ble_reg_ant_switch_tx_map_3</name>
          <description>Tx Antenna Switch Map: Map 3</description>
          <addressOffset>0x910</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_ant_switch_index_0</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_1</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_2</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ant_switch_index_3</name>
              <description>Antenna Switch Map, Antenna switch map is programmed in a group of 10; 32-bit registers; which represents 40 different values; each value being 5-bit wide for 32 antennas. Switching pattern starts from BLE_REG_ANT_SWITCH_TX_MAP_0; and follows the index order of tx_ant_switch_index_0.1.2.to 3; while BLE_REG_ANT_SWITCH_TX_MAP_0 finishes; continues with the other 4 indexes in BLE_REG_ANT_SWITCH_TX_MAP_1.2.to 9. The pattern length use is determined by tx_ant_map_length.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
