nxp-mcuxpresso/mcux-soc-svd/MCXW70AD/MCXW70AD.xml
        <register>
          <name>btu_rif_reg_debug_sw_msg</name>
          <description>BLE Debug Software Message</description>
          <addressOffset>0xCDA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>debug_sw_msg</name>
              <description>Debug message, Software message is written into this register and transfered into FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_reg_debug_sw_msg_fifo_cnt</name>
          <description>BLE Debug Software Message FIFO Count</description>
          <addressOffset>0xCDC</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_reg_debug_sw_msg_fifo_cnt</name>
              <description>Debug message FIFO count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_testbus_control</name>
          <description>RIF Testbus Control</description>
          <addressOffset>0xCDE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>btu_rif_testbus_control</name>
              <description>Testbus bank rotation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>btu_rif_testbus_en</name>
              <description>Enable debug mode to use BTU testbus</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_bt_clk_gating</name>
          <description>RIF Bluetooth Clock Gating</description>
          <addressOffset>0xCF0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>bt_reg_aes_clk_en</name>
              <description>AES Clock Enable, If set; Force bt_aes_clk to turn on., Otherwise; bt_aes_clk_en controls bt_aes_clk gating.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_rif_rx_4m_clk_en</name>
              <description>RIF Rx 4M Clock Enable, 0x0: rif_rx_4m_clk_en controls clock gating, 0x1: forces rif_rx_4m_clk to turn on</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_rif_rx_16m_clk_en</name>
              <description>RIF Rx 16M Clock Enable, 0x0: rif_rx_16m_clk_en controls clock gating for rif_rx_16m_clk, 0x1: forces rif_rx_16m_clk to turn on</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_force_ebram_sysclk_en</name>
              <description>Force EBRAM ebSysClk enable, When set; ebSysClk to EBRAM is always ON; it is not gated.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_aes_sys_clk_en</name>
              <description>Force aes sys clk enable, When set; sys clk to hw aes arbiter is always ON; it is not gated.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_clk_smpld</name>
          <description>RIF Clock Sampled, Mux select for Sampled generation logic.</description>
          <addressOffset>0xCF4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>btu_4m_smpld_mux</name>
              <description>4M Sampled MUX, Mux select to select the sync method., First method does not require the clocks to be in phase., Second wethod requires cloks to be in phase (synchronization between 4 MHz clock and ebSysClkIn)., If this bit is set to 1; it uses first method., This signal is used for both BTC and BLE.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rif_rx_4m_smpld_mux</name>
              <description>RIF Rx 4M Sampled MUX, Mux select to select sync methods., First method does not require clocks to be in phase., Second method requires clocks to be in phase (Used in synchronization between 16 MHz and 4 MHz clock. Used for sampling Gen4 data.), If set to 1; select first method.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_ble_clk_gating</name>
          <description>RIF BLE Clock Gating, Clock Enable register for BLE Clocks.</description>
          <addressOffset>0xCF8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>bt_reg_ble_sleep_clk_en</name>
              <description>BLE Sleep Clock Enable, If set; forces ble_sleep_clk to turn on.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_ble_force_clk_en</name>
              <description>BLE Force Clock Enable, If set; forces all BLE internal clocks to turn on.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_ble_slv_hclk_en</name>
              <description>BLE Slave HCLK Enable, 0x0: ble_slv_hclk_en controls clock gating dynamically, 0x1: forces ble_sys_td_clk_en to turn on</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_ble_mst_hclk_en</name>
              <description>BLE Master HCLK Enable, 0x0: ble_mst_hclk_en controls clock gating, 0x1: forces ble_mst_hclk to 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_ble_ric_sys_clk_en</name>
              <description>BLE RIC System Clock Enable, 0x0: ble_ric_sys_clk_en controls dynamic clock gating, 0x1: force ble_ric_sys_clk to turn on</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_ble_tx_clk_en</name>
              <description>BLE Tx Clock Enable, 0x0: ble_tx_clk_en controls clock gating for ble_tx_clk, 0x1: forces ble_tx_clk; also forces ble_td_sys_clk_en to be set</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_ble_rx_clk_en</name>
              <description>BLE Rx Clock Enable, 0x0: ble_rx_clk controls clock gating dynamically, 0x1: forces ble_rx_clk clocks to turn on; also forces ble_rd_sys_clk to turn on</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_ble_td_sys_clk_en</name>
              <description>BLE TD System Clock Enable, 0x0: ble_td_sys_clk_en controls clock gating dynamically, 0x1: forces ble_td_sys_clk to turn on</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_ble_rd_sys_clk_en</name>
              <description>BLE RD System Clock Enable, 0x0: ble_rd_sys_clk_en controls dynamic clock gating, 0x1: forces ble_rd_sys_clk to turn on</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_ble_rl_sys_clk_en</name>
              <description>BLE RD System Clock Enable, 0x0: ble_rl_sys_clk_en controls dynamic clock gating, 0x1: forces forces ble_rl_sys_clk to turn on</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_ble_wl_sys_clk_en</name>
              <description>BLE Whitelist Search System Clock Enable, 0x0: ble_wl_sys_clk_en controls dynamic clock gating, 0x1: forces ble_wl_sys_clk to turn on</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_ble_irk_sys_clk_en</name>
              <description>BLE IRK resolve System Clock Enable, 0x0: ble_irk_sys_clk_en controls dynamic clock gating, 0x1: forces ble_irk_sys_clk to turn on</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_ble_tmrs_clk_en</name>
              <description>BLE cdt and pst timers clock enable, 0x0: ble_tmr_4m_clk_en controls dynamic clock gating, 0x1: forces ble_tmr_4m_clk_en to turn on</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_ble_tmrreg_sys_clk_en</name>
              <description>BLE timer registers clock enable, 0x0: BTU controls dynamic sysclk gating on SWT; CDT and PST registers, 0x1: forces SWT; CDT and PST registers sysclk to turn on</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_ble_clk_ctrl</name>
          <description>RIF BLE Clock Control, Register for Clock Control Logic</description>
          <addressOffset>0xCFC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>bt_reg_force_ble_clk_req_zero</name>
              <description>Force BLE Clock Req Zero, ble_sp_req is set to put BLE to sleep. When a write (1 or 0) to this register is detected; BLE will set ble_clk_req to 0 and go to sleep. This will gate off all BLE clocks.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_force_ble_clk_req_one</name>
              <description>Force BLE Clock Req One, When set; ble_clk_req will always be forced to 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_awake_sts</name>
              <description>BLE Awake Status, This bit indicates if BLE is in sleep or awake.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_clk_req_early_assert</name>
              <description>ble_clk_req early assertion upon any BLE AHB access, Setting this bit will enable ble_clk_req early assertion upon any BLE AHB access; which allows bt_clk_req to be asserted earlier to APU.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_sys_4m_early_ungate</name>
              <description>ble_sys_clk and ble_4m_clk early ungated upon any BLE AHB access, Setting this bit will allow ble_sys_clk and ble_4m_clk being ungated earlier upon any BLE AHB access during BLE sleep for faster BLE register access.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_ble_dbus_tx_pkt_end</name>
          <description>BLE RIF dBus Tx Packet End Control</description>
          <addressOffset>0xD00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1E</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>dbus_tx_pkt_end_delay</name>
              <description>dBus Tx Packet End Delay, Time from the end of active Tx payload to dBus command that sets the radio back to IDLE., - Resolution: 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_ble_dbus_rx_pkt_end</name>
          <description>BLE RIF dBus Rx Packet End Control</description>
          <addressOffset>0xD02</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x12</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>dbus_rx_pkt_end_delay</name>
              <description>dBus Rx Packet End Delay, Time from the end of active Rx payload to dBus command that sets the radio back to IDLE., - Resolution: 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_ble_dbus_tx_rampdown</name>
          <description>BLE RIF dBus Tx Rampdown Control</description>
          <addressOffset>0xD04</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>dbus_tx_rampdown_delay</name>
              <description>dBus Tx Rampdown Delay, Delay time after the end of a Tx slot for ramping down the radio over the dBus., Resolution 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_ble_dbus_rssi</name>
          <description>BLE RIF dBus RSSI</description>
          <addressOffset>0xD06</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>dbus_rssi_delay</name>
              <description>Delay from RSSI trigger to start of RSSI read, Delay from the end of rif_rx_req to enable dBus RSSI read back., Resolution 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_adaptivity_ctrl</name>
          <description>BT Adaptivity Control, Register for BT Adaptivity Control</description>
          <addressOffset>0xD30</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_cca_dis</name>
              <description>BLE CCA disable bit, FW override to disable CCA for current BLE Tx pkt. - Revert to normal Tx timing; clear A1 cca_before_tx_en bit; ignore brf_bt_cca_tx_drop; and no R2 DBUS. FW should set this bit before start_rif_tx time; and clear this bit before the next TX packet's start_rif_tx time.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cca_ed_factor</name>
              <description>Forgetfactor for CCA NF linear mean averaging, Controls how many previous NF readings in the same channel are considered for NF linear mean averaging</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_cca_ebram_rst_dyn</name>
              <description>Reset bit for BLE CCA abort counters, Reset all BLE CCA abort counters in EBRAM. This bit is self clearing.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_cca_ebram_stat_en</name>
              <description>Enable bit for BLE CCA EBRAM STATISTICS, Enable BLE CCA abort counters and NF averaging in EBRAM.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_tx_nf_en</name>
              <description>BLE NF during TX enable, Reading inband power in each TX channel gives the Noise Floor in that channel. This can be used for NF measurement; replacing scheduled NF measurement slots in BLE. When this bit is set; design works in NF mode. CCA is performed and NF is read back. brf_bt_cca_tx_drop indication from BRF is ignored. This bit is meant to be used together with ble_tx_cca_en bit ble_tx_cca_en = 1; ble_tx_nf_en = x:CCA is done; NF is read back; brf abort indication aborts TX (EU regulatory mode) ble_tx_cca_en = 0; ble_tx_nf_en = 1:CCA is done; NF is read back; brf abort indication ignored (Non EU countries can use this mode) ble_tx_cca_en = 0; ble_tx_nf_en = 0:CCA is not done before TX. Old behavior (legacy)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_tx_cca_en</name>
              <description>BLE CCA before TX enable, Global enable for BLE CCA before Tx scheme - new CA1; CA2 to BRF; bt_pll_req; brf_pu; fesw; bca_bt_grant_n new Tx timing to BCA/BRF; CCA abort handling (to BCA); new R2 DBUS; cca abort statistic in EBRAM and NF averaged in EBRAM</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_ble_cca_ed_readback</name>
          <description>BLE ED Mag readback value, BLE ED Mag readback value</description>
          <addressOffset>0xD3A</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_cca_ed_mag</name>
              <description>BLE CCA ED Magnitude, BLE CCA ED Magnitude readback from R2 DBUS)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_cca_ed_vld</name>
              <description>BLE CCA ED valid, BLE CCA ED valid indication. If packet is aborted before R2 time; the ble_cca_ed_mag may be invalid. This bit is set to 1 when ble_cca_ed_mag is valid.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_dbus_cca_tx_pwrctl</name>
          <description>CCA TX PWRCTL Dbus, CCA TX PWRCTL Dbus</description>
          <addressOffset>0xD3C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>dbus_cca_tx_pwr_ctrl_wr_delay</name>
              <description>CCA TX PWRCTL Dbus Delay, Delay value to position CA1 timing. Resolution 0.25us</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dbus_cca_tx_pwr_ctrl_wr_en</name>
              <description>CCA TX PWRCTL Dbus Enable, Enable CA1 DBUS. CA1 is performed only when this bit is set and also BT adaptivity features is enabled for the current controller (BTC or BLE)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_dbus_cca_tx_fsyn</name>
          <description>CCA TX FSYN Dbus, CCA TX FSYN Dbus</description>
          <addressOffset>0xD3E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>dbus_cca_tx_fsyn_wr_delay</name>
              <description>CCA TX FSYN Dbus Delay, Delay value to position CA1 timing. Resolution 0.25us</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dbus_cca_tx_fsyn_wr_en</name>
              <description>CCA TX FSYN Dbus Enable, Enable CA2 DBUS. CA2 is performed only when this bit is set and also BT adaptivity features is enabled for the current controller (BTC or BLE)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
