nxp-mcuxpresso/mcux-soc-svd/MCXW70AD/MCXW70AD.xml
        <register>
          <name>btu_rif_dbus_cca_ed</name>
          <description>CCA TX R2 Dbus, CCA TX R2 Dbus</description>
          <addressOffset>0xD40</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x70</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>dbus_cca_ed_delay</name>
              <description>CCA TX R2 Dbus Delay, Delay value to position R2 timing. The delay is counted from the end of S pulse on BTU-BRF interface.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dbus_cca_ed_en</name>
              <description>CCA TX R2 Dbus Enable, Enable R2 DBUS. R2 is performed only when this bit is set and also BT adaptivity features is enabled for the current controller (BTC or BLE)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_brf_cca_ed_addr</name>
          <description>BRF CCA ED Address, BRF CCA ED Address</description>
          <addressOffset>0xD42</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x328</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>dbus_cca_ed_addr</name>
              <description>BRF CCA ED Address, BRF register address for Inband Power Readback via R2 DBUS.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_btc_cca_ca1_2_delay</name>
          <description>BTC CCA CA1 CA2 Delays, BTC CCA CA1 CA2 Delays</description>
          <addressOffset>0xD44</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xA00</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rif_ca1_2_offset_for_abort_b4_cca_us</name>
              <description>CA1 CA2 offset for the case of abort before CCA TX, Additional offset to delay CA1 and CA2 when CCA pkt was after a bt rif abort or FFU bca abort. The default is to delay CA1;2 in these cases by 10us to allow BRF MCU to accept these DBUS timely.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_ble_cca_ebram_addr</name>
          <description>BLE CCA EBRAM Address Offset, BLE CCA EBRAM Address Offset</description>
          <addressOffset>0xD48</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_cca_ebram_addr</name>
              <description>BLE CCA EBRAM Address Offset, This register is the EBRAM offset value for BLE CCA statistics location.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_ble_cca_threshold</name>
          <description>BLE CCA Counter thresholds, BLE CCA Counter thresholds</description>
          <addressOffset>0xD4A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xF001</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rif_ble_cca_abort_pkt_cnt_thd</name>
              <description>BLE CCA abort packet count threshold, 8-bit value of threshold to be used along with EBRAM abort statistics. BTU will generate ble_cca_abort_thd_cnt_met interrupt to SW when the number of CCA aborted packets in any single channel have reached or exceeded this threshold value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rif_ble_cca_tx_pkt_cnt_thd</name>
              <description>BLE CCA TX packet count threshold, 8-bit value of threshold to be used along with EBRAM abort statistics. BTU will generate ble_cca_tx_cnt_thd_met interrupt to SW when the number of total CCA TX packets in any single channel have reached or exceeded this threshold value.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_cca_ble_threshold_met_sts</name>
          <description>BLE CCA threshold met status, BLE CCA threshold met status</description>
          <addressOffset>0xD50</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>rif_ble_cca_abort_cnt_thd_met_ch</name>
              <description>BLE CCA abort count threshold met channel number, BLE channel read-back value; on which the CCA abort threshold was met; causing ble_cca_abort_thd_met interrupt to CPU</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rif_ble_cca_tx_cnt_thd_met_ch</name>
              <description>BLE CCA TX count threshold met channel number, BLE channel read-back value; on which the CCA total TX packet count threshold was met; causing ble_cca_txpkt_thd_met interrupt to CPU</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_rif_cca_ble_rx_fesw_delay</name>
          <description>BLE CCA RX FESW DELAYS, BLE CCA RX FESW DELAYS</description>
          <addressOffset>0xD56</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x5E36</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_btrx_fesw_during_cca_on_delay</name>
              <description>BLE btrx_fesw ON delay for CCA TX packets, Number of microseconds from wakeUp to turning on btrx_fesw for CCA portion of BLE Tx packets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_btrx_fesw_during_cca_off_delay</name>
              <description>BLE btrx_fesw OFF delay for CCA TX packets, Number of microseconds from wakeUp to turning off btrx_fesw for CCA portion of BLE Tx packets</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_ctrl</name>
          <description>PTA Control</description>
          <addressOffset>0xF02</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x20</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>reg_bt_tx_pwr_gate_en</name>
              <description>BT tx power enable for BCA, BT tx power enable for BCA, 0x0: Bt tx power is disabled, 0x1: Bt tx power is enabled</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_pta_rx_4m_clk_en</name>
              <description>PTA Clock Gate Enable Override, PTA Clock Gate Enable Override; if set to 1; clock gating for PTA clocks is disabled = ungated clocks.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_grant_bypass_en</name>
              <description>BCA coex grant bypass enable, When bt_grant_bypass_en is set; BCA coex grant bca_bt_grant_n is controlled by bt_grant_bypass_val register., 0x0: disable bt_grant_n bypass, 0x1: enable bt_grant_n bypass</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_grant_bypass_val</name>
              <description>BCA coex grant bypass value, When bt_grant_bypass_en is set; BCA coex grant bca_bt_grant_n is controlled by this register., 0x0: set BCA coex grant bt_grant_n to zero, 0x1: set BCA coex grant bt_grant_n to one</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>clralltxcntrs</name>
              <description>Clear All Tx Counters, When set; all of the PTA diagnostic counters are reset to 0:, - Tx_Req_Hi_Cnt, - Tx_Loss_Hi_Cnt, - Tx_Loss_Med_Cnt, - Tx_Req_Med_Cnt, - Tx_Req_Med_Hi; Cnt, - Tx_Loss_Med_Hi_Cnt, 0x0: do not clear counters, 0x1: clear counters</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
            </field>
            <field>
              <name>mrvlcoexexiten</name>
              <description>Marvell Coexistence Exit Enable, Enable the reset of the MRVL coexistence state machine if neither rifTx nor rifRx is active at frameTick such that BT_REQ will go low., 0x0: disable, 0x1: enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_req_delay_timer</name>
          <description>PTA Bt_Req Delay Timer</description>
          <addressOffset>0xF04</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>pta_req_delay</name>
              <description>PTA Request Delay, When BTU uses MRVL Coexistence mode; this controls the delay from pta_tx_req/pta_rx_req to the rising edge of the BT_REQ., This value should never be programmed more than 15us; otherwise unexpected behavior will occur; such as dropped packets due to BCA grant timeout., - Unit: 0.25 us.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_ble_rif_arb_coex_pri</name>
          <description>BLE PTA Priority for BTC/BLE arbitration, BLE coex priority for BTC/BLE arbitration.</description>
          <addressOffset>0xF14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_tx_pri</name>
              <description>BLE Coex Priority, The BLE Tx packet high/medium priority that is used to make RIF_ARB arbitration request.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_rx_pri</name>
              <description>BLE Coex Priority, The BLE Rx packet high/medium priority that is used to make RIF_ARB arbitration request.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_ble_bca_coex_pri</name>
          <description>BLE PTA Priority for BCA arbitration, BLE coex priority for BCA arbitration.</description>
          <addressOffset>0xF16</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_tx_pri</name>
              <description>BLE Coex Priority, The BLE Tx packet high/medium priority that is used to make BCA request.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_rx_pri</name>
              <description>BLE Coex Priority, The BLE Rx packet high/medium priority that is used to make BCA request.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_inactivity_refclk_0</name>
          <description>Bluetooth Reference Clock Snapshot on MWS_Inact_Msg_Real_Int Interrupt</description>
          <addressOffset>0xF18</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mwsinactmsg_refclk</name>
              <description>Bluetooth Reference Clock Snapshot on MWS_Inact_Msg_Real_Int Interrupt, Contains the lower 16-bit of the reference clock[27:2] when the MWS_Inact_Msg_Real_Int interrupt pulse is detected.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_inactivity_refclk_1</name>
          <description>Bluetooth Reference Clock Snapshot on MWS_Inact_Msg_Real_Int Interrupt</description>
          <addressOffset>0xF1A</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mwsinactmsg_refclk</name>
              <description>Bluetooth Reference Clock Snapshot on MWS_Inact_Msg_Real_Int Interrupt, Contains the upper 10-bit of the reference clock[27:2] when the MWS_Inact_Msg_Real_Int interrupt pulse is detected.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mws_inactivity_refpdb_cnt</name>
          <description>Bluetooth Reference pdBitCounter Snapshot on MWS_Inact_Msg_Real_Int Interrupt</description>
          <addressOffset>0xF1C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mwsinactmsg_pdbitcnt</name>
              <description>Bluetooth Reference pdBitCounter Snapshot on MWS_Inact_Msg_Real_Int Interrupt, Contains the reference pdBitCounter[12:0] when the MWS_Inact_Msg_Real_Int interrupt pulse is detected.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_inband_freq_set_1</name>
          <description>PTA Inband Frequency Set 0, BT_FREQ is set when (BT_In_Band_Hi &gt;= freqNr &gt;= BT_In_Band_Lo) in MRVL Coexistence mode and BT_In_Band1_Freq_En is enabled. 2 sets of band gaps; final BT_FREQ is OR version of 2 sets.</description>
          <addressOffset>0xF1E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>bt_in_band_lo</name>
              <description>Bluetooth In Band Low, In MRVL Coexistence mode; this is the low bound of the frequency channel for BT_FREQ.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_in_band_hi</name>
              <description>Bluetooth In Band High, In MRVL Coexistence mode; this is the high bound of the frequency channel for BT_FREQ.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_mode_select</name>
          <description>PTA Mode Select</description>
          <addressOffset>0xF20</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>bt_coex_mode</name>
              <description>Bluetooth Coexistence Mode Select, 0x0: disable, 0x1: CSR mode, 0x2: MRVL mode, 0x3: SUSHI mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_mws_coex_en</name>
              <description>Bluetooth and MWS Coexistence Mode Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_ovlp_mode</name>
              <description>Bluetooth Overlap Mode, Select bt_overlap assertion mode, 0x0: non-filtered; old design, 0x1: filtered mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ovlp_supress_en</name>
              <description>Overlap Suppression Enable, Suppress BT_Overlap/BT_Scan_Overlap assertion if Tx power is less than the programmed threshold., 0x0: disable, 0x1: enable, BT_Overlap/BT_Scan_Overlap assertion to BCA will be suppressed if Tx_Power_Index, Value is less than the programmed BTU_PTA_TX_POWER_THRESHOLD for BR/EDR packet, type or is less than BTU_PTA_BLE_TX_PWR_THRHD for BLE packet.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_scan_ovlp_mode</name>
              <description>Bluetooth Scan Overlap Mode, Select bt_scan_overlap assertion mode, 0x0: non-filtered; old design, 0x1: filtered mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_scan_ovlp_rx_en</name>
              <description>Scan Overlap for Bluetooth Rx, Enables bt_scan_overlap assertion for Bluetooth Rx., 0x0: disable, 0x1: enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_3dg_coex_en</name>
              <description>Bluetooth and 3D-Glass Coexistence Mode Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_in_band1_freq_en</name>
              <description>BTU_PTA_INBAND_FREQ_SET_1 Band Gap Use Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_tx_on_mode</name>
              <description>BT_TX_ON mode selection, Selects the mode of operation for asserting the BT_TX_ON signal., - Bit[15]: Direct Mode: BT_TX_ON signal assertion is independent of MWS Rx and MWS scan operations, - Bit[14]: Filtered Mode: BT_TX_ON signal is asserted in real time by hardware by taking into account of MWS Rx overlap and MWS scan overlap conditions</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_inband_freq_set_0</name>
          <description>PTA Inband Frequency Set 1, BT_FREQ is set when (BT_In_Band_Hi &gt;= freqNr &gt;= BT_In_Band_Lo) in MRVL Coexistence mode. 2 sets of band gaps; final BT_FREQ is OR version of 2 sets.</description>
          <addressOffset>0xF22</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>bt_in_band_lo</name>
              <description>Bluetooth In Band Low, In MRVL Coexistence mode; this is the low bound of the frequency channel for BT_FREQ.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_in_band_hi</name>
              <description>Bluetooth In Band High, In MRVL Coexistence mode; this is the high bound of the frequency channel for BT_FREQ.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>btu_pta_harq_pattern_sel_refclk_0</name>
          <description>Bluetooth Reference Clock Snapshot on HARQ_Pattern_Sel_Real_Int Interrupt</description>
          <addressOffset>0xF24</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>harqpatternsel_refclk</name>
              <description>Bluetooth Reference Clock Snapshot on HARQ_Pattern_Sel_Real_Int Interrupt, Contains the lower 16-bit of the referenceClock[27:2] when the HARQ_Pattern_Sel_Real_Int interrupt pulse is detected.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
