nxp-mcuxpresso/mcux-soc-svd/MCXW70AD/MCXW70AD.xml
        <register>
          <name>BTU_RIF_SWDBUS_DATA_7_6</name>
          <description>RIF Software dBus Data_7_6</description>
          <addressOffset>0xC4A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>sw_dbus_wdata6</name>
              <description>Software Access Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_dbus_wdata7</name>
              <description>Software Access Data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_TX_FESW</name>
          <description>RIF Tx FESW</description>
          <addressOffset>0xC4C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x9036</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>TX_Fesw_On_Delay</name>
              <description>Tx FESW On Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_Fesw_Off_Delay</name>
              <description>Tx FESW Off Delay</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_Fesw_En</name>
              <description>Tx Front-End Switch (FESW) Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>bttx_fesw is fixed to 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>enable FESW during for Tx packets</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_RX_FESW</name>
          <description>RIF Rx FESW</description>
          <addressOffset>0xC4E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8A15</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>RX_FESW_On_Delay</name>
              <description>Rx FESW On Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_FESW_Off_Delay</name>
              <description>Rx FESW Off Delay</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_FESW_En</name>
              <description>Rx FESW Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>btrx_fesw is fixed to 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>enable FESW during for Rx packets</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_RXPAON</name>
          <description>RIF Rx PA On</description>
          <addressOffset>0xC50</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8142</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Rx_PA_On_Delay</name>
              <description>Rx PA on Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Rx_PA_On_En</name>
              <description>Rx PA On Delay Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BRF_RX_PU</name>
          <description>RIF BRF Power Up for RX</description>
          <addressOffset>0xC52</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x227</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>brf_rx_pu_on_delay_qus</name>
              <description>brf_pu on delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brf_rx_pu_off_delay_qus</name>
              <description>brf_pu off delay</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brf_rx_pu_fixed</name>
              <description>Set brf_pu to a fixed value.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>use programmable timers</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>fixed, brf_pu = brf_pu_on_delay_us[0]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BTC_DBUS_TX_PKT_END</name>
          <description>BTC RIF dBus Tx Packet End Control</description>
          <addressOffset>0xC54</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x801E</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DBus_Tx_Pkt_End_Delay</name>
              <description>dBus Tx Packet End Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBus_Tx_Pkt_End_Enable</name>
              <description>Tx Packet End dBus Transaction Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BTC_DBUS_RX_PKT_END</name>
          <description>BTC RIF dBus Rx Packet End Control</description>
          <addressOffset>0xC56</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8012</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DBus_Rx_Pkt_End_Delay</name>
              <description>dBus Rx Packet End Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBus_Rx_Pkt_End_Enable</name>
              <description>Rx Packet End dBus Transaction Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BTC_DBUS_TX_RAMPDOWN</name>
          <description>BTC RIF dBus Tx Rampdown Control</description>
          <addressOffset>0xC58</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8008</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DBus_Tx_Rampdown_Delay</name>
              <description>dBus Tx Rampdown Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBus_Tx_Rampdown_Enable</name>
              <description>Enables Automatic Rampdown radio after Tx slot on the dBus</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>disable automatic ramping down the radio after Tx slot</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>enable automatic ramping down the radio after Tx slot</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_ERR_PATTERN_TX</name>
          <description>RIF Error Pattern Tx</description>
          <addressOffset>0xC6C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Err_Pattern_Tx</name>
              <description>16-bit Error Pattern for Tx Packets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>no error injection</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>flip corresponding bit of Tx packets</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_ERR_DELAY1_TX</name>
          <description>RIF Error Delay 1 Tx</description>
          <addressOffset>0xC6E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Err_Delay1_Tx</name>
              <description>Position of Error Insertion in Tx Packet</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_ERR_DELAY2_TX</name>
          <description>RIF Error Delay 2 Tx</description>
          <addressOffset>0xC70</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Err_Delay2_Tx</name>
              <description>Position of Error Insertion in Tx Packet</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_ERR_DELAY3_TX</name>
          <description>RIF Error Delay 3 Tx</description>
          <addressOffset>0xC72</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Err_Delay3_Tx</name>
              <description>Position of Error Insertion in Tx Packet</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_ERR_INJ_TX_CTRL</name>
          <description>RIF Error Injection Tx Control</description>
          <addressOffset>0xC74</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Err_Tx_En</name>
              <description>Error Injection Logic for Tx Packets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>disable all error injection logic for Tx packets</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>enable error injection logic for Tx packets</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Err_Tx_Mode</name>
              <description>Error Injection for Tx Packets</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>inject error on nErr_Pkts_Tx number of Tx packets</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>inject error on all Tx packets continuously based on Err_Delay'_Tx timer selected in Frame Scheduler</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>nErr_Pkts_Tx</name>
              <description>Number of Tx Error Packets</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>corrupt infinite number of Tx packets</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>n/a</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>tx_acl_dma_crc_cor</name>
              <description>TX SCO AES Error CRC Corruption Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_acl_aes_crc_cor</name>
              <description>TX ACL DMEM Error CRC Corruption Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_acl_dmem_crc_cor</name>
              <description>TX ACL DMA Error CRC Corruption Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_esco_dma_crc_cor</name>
              <description>TX SCO AES Error CRC Corruption Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_esco_aes_crc_cor</name>
              <description>TX eSCO DMEM Error CRC Corruption Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_esco_dmem_crc_cor</name>
              <description>TX eSCO DMA Error CRC Corruption Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_crc_cor_en</name>
              <description>Continous CRC corruption</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_ERR_PATTERN_RX</name>
          <description>RIF Error Pattern Rx</description>
          <addressOffset>0xC76</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Err_Pattern_Rx</name>
              <description>16-bit Error Pattern for Rx Packets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>no error injection</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>flip corresponding bit of Rx packets</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_ERR_DELAY1_RX</name>
          <description>RIF Error Delay 1 Rx</description>
          <addressOffset>0xC78</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Err_Delay1_Rx</name>
              <description>Position of Error Insertion in Rx Packet</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_ERR_DELAY2_RX</name>
          <description>RIF Error Delay 2 Rx</description>
          <addressOffset>0xC7A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Err_Delay2_Rx</name>
              <description>Position of Error Insertion in Rx Packet</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_ERR_DELAY3_RX</name>
          <description>RIF Error Delay 3 Rx</description>
          <addressOffset>0xC7C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Err_Delay3_Rx</name>
              <description>Position of Error Insertion in Rx Packet</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
