nxp-mcuxpresso/mcux-soc-svd/MCXW70AD/MCXW70AD.xml
        <register>
          <name>FMC1_CTRL</name>
          <description>Control for Flash Memory Controller 1</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DNCBEI</name>
              <description>Disable non-correctable bus errors on flash instruction fetches</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DNCBEI_0</name>
                  <description>Bus error for non-correctable error on instruction fetch from flash</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DNCBEI_1</name>
                  <description>Disable bus error response for non-correctable error on instruction fetch from flash</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DNCBED</name>
              <description>Disable non-correctable bus errors on flash data fetches</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DNCBED_0</name>
                  <description>Bus error for non-correctable error on data fetch from flash</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DNCBED_1</name>
                  <description>Disable bus error response for non-correctable error on data fetch from flash</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DDP</name>
              <description>Disable Data Prefetch</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DDP_0</name>
                  <description>Enable Data Prefetch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDP_1</name>
                  <description>Disable Data Prefetch</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFS</name>
              <description>Disable Flash Speculate</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DFS_0</name>
                  <description>Enable Flash Speculate</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFS_1</name>
                  <description>Disable Flash Speculate</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LKIFR1</name>
              <description>Lock IFR1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LKIFR1_0</name>
                  <description>IFR1 space can be accessed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LKIFR1_1</name>
                  <description>IFR1 space cannot be accessed. This bit is sticky. Once set, it is cleared with reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECFC</name>
              <description>Execute clear the flash cache</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECFC_0</name>
                  <description>do not clear the flash cache</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECFC_1</name>
                  <description>clear the flash cache (negate all valid bits in the cache)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFDC</name>
              <description>Disable flash data caching</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DFDC_0</name>
                  <description>enable flash data caching</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFDC_1</name>
                  <description>disable flash data caching</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFIC</name>
              <description>Disable flash instruction caching</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DFIC_0</name>
                  <description>enable flash instruction caching</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFIC_1</name>
                  <description>disable flash instruction caching</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFC</name>
              <description>Disable Flash Cache</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DFC_0</name>
                  <description>the flash cache is enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFC_1</name>
                  <description>the flash cache is diabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFLEXSTALL</name>
              <description>Flash Stall Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PFLEXSTALL_0</name>
                  <description>Flash stall is disabled when flash is busy.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFLEXSTALL_1</name>
                  <description>Flash stall is enabled when flash is busy.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RO</name>
              <description>Read-Only</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RO_0</name>
                  <description>Writes to the FMC1_CTRL are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RO_1</name>
                  <description>Writes to the FMC1_CTRL are ignored</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_RF_WAKE_MAIN_0</name>
          <description>DMA request 0-31 to wake up main domain</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>disbale_main_wake_reg0</name>
              <description>Disable Wake Up Main by DMA request 0-31</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disbale_main_wake_reg0_0</name>
                  <description>Keep wake up MAIN</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disbale_main_wake_reg0_1</name>
                  <description>Not wake up MAIN</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_RF_WAKE_MAIN_1</name>
          <description>DMA request 32-63 to wake up main domain</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>disbale_main_wake_reg1</name>
              <description>Disable Wake Up Main by DMA request 32-63</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disbale_main_wake_reg1_0</name>
                  <description>Keep wake up MAIN</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disbale_main_wake_reg1_1</name>
                  <description>Not wake up MAIN</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_20MHZ_CLOCK_CTRL</name>
          <description>Flexcan 20MHZ Clock Control</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA0005</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAN_20MHZ_EN</name>
              <description>Enable 20mhz For FlexCAN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAN_20MHZ_EN_5</name>
                  <description>Disable 20mhz clock for CAN, any other value also disable it.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_20MHZ_EN_10</name>
                  <description>Enable 20mhz clock for CAN</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRO_CALIBRATION_EN</name>
              <description>Enable FRO Calibration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRO_CALIBRATION_EN_5</name>
                  <description>Disable FRO Calibration, any other value also disable it.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO_CALIBRATION_EN_10</name>
                  <description>Enable FRO Calibration</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM0_ECC_CONTROL</name>
          <description>SRAM0 ECC Function Control</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EERW</name>
              <description>Enable ECC write generation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EERW_0</name>
                  <description>Disable ECC on reads</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EERW_1</name>
                  <description>Enable ECC on reads</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EERC</name>
              <description>Enable ECC read check</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EERC_0</name>
                  <description>Disable ECC on writes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EERC_1</name>
                  <description>Enable ECC on writes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM0_ECC_REPORT</name>
          <description>SRAM0 ECC Error Report Control</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENCR</name>
              <description>Enable RAM ECC Non-correctable Reporting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENCR_0</name>
                  <description>Non-correctable reporting and interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENCR_1</name>
                  <description>Non-correctable reporting and interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>E1BR</name>
              <description>Enable RAM ECC 1 Bit Reporting</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>E1BR_0</name>
                  <description>1-bit reporting disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>E1BR_1</name>
                  <description>1-bit reporting enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM0_ECC_EVENT_RECORD</name>
          <description>SRAM0 ECC Error Event Record</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xF0FFFFFF</resetMask>
          <fields>
            <field>
              <name>ENCERRN</name>
              <description>ECC Non-correctable Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>E1BERRN</name>
              <description>ECC 1-bit Error</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>EELOC</name>
              <description>ECC Error Location</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EELOC_2</name>
                  <description>non-correctable on SRAM0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EELOC_10</name>
                  <description>1-bit correctable on SRAM0</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALID</name>
              <description>Valid ECC Error Location field</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALID_0</name>
                  <description>ECC Error Location field is not valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID_1</name>
                  <description>ECC Error Location field is valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM0_ECC_FAULT_ADDR</name>
          <description>SRAM0 Fault Address Register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EFADD</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
