nxp-mcuxpresso/mcux-soc-svd/MCXW70AD/MCXW70AD.xml
        <register>
          <name>RF2p4GHz_WOR2</name>
          <description>2.4GHz WOR Register 2</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DURATION</name>
              <description>WOR Low Power Duration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WOR_WKUP</name>
              <description>WOR Wakeup</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WOR_WKUP_0</name>
                  <description>WOR low power mode wakeup deasserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WOR_WKUP_1</name>
                  <description>WOR low power mode wakeup asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WOR_EN</name>
              <description>WOR Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WOR_EN_0</name>
                  <description>WOR low power mode entry/wakeup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WOR_EN_1</name>
                  <description>WOR low power mode entry/wakeup enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RF2p4GHz_MAN1</name>
          <description>2.4GHz MAN Register 1</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENTER_TIME</name>
              <description>MAN Low Power Entry Time Stamp</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENTER_REQ</name>
              <description>MAN Low Power Entry Request</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENTER_REQ_0</name>
                  <description>MAN low power mode request deasserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENTER_REQ_1</name>
                  <description>MAN low power mode request asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RF2p4GHz_MAN2</name>
          <description>2.4GHz MAN Register 2</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WKUP_TIME</name>
              <description>MAN Low Power Wakeup Time Stamp</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAN_WKUP</name>
              <description>MAN Wakeup</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAN_WKUP_0</name>
                  <description>MAN low power mode wakeup deasserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAN_WKUP_1</name>
                  <description>MAN low power mode wakeup asserted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAN_EN</name>
              <description>MAN Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAN_EN_0</name>
                  <description>MAN low power mode entry/wakeup disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAN_EN_1</name>
                  <description>MAN low power mode entry/wakeup enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RF2p4GHz_MAN3</name>
          <description>2.4GHz MAN Register 3</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENTER_TIME_CAPT</name>
              <description>MAN Low Power Entry Time Captured</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF2p4GHz_MAN4</name>
          <description>2.4GHz MAN Register 4</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WKUP_TIME_CAPT</name>
              <description>MAN Low Power Wakeup Time Captured</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF2p4GHz_HOST2RADIO</name>
          <description>RF 2.4GHz Buffer from Host to Radio</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data of Buffer0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF2p4GHz_RADIO2HOST</name>
          <description>RF 2.4GHz Buffer from Radio to Host</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data of Buffer0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF2p4GHz_CFG</name>
          <description>2.4GHz Radio Configuration Register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BLE_FAST_WKUP</name>
              <description>No LP Wakeup Delay on WakeUp from Host</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFMC_RADIO_DEBUG_REQ_EN</name>
              <description>rfmc_radio_debug_req_en</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFMC_EXT_WAKEUP_EN</name>
              <description>Enable Radio wakeup by external source</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_DBG_PWRUP_ACK</name>
              <description>Controls the Radio ack so that Radio can go into power down in debug mode also</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF2p4GHz_WKUP_SRC</name>
          <description>2.4GHz Radio WakeUp Source Register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RFMC_RADIO_DEBUG_REQ_STATUS</name>
              <description>Radio debug request status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RFMC_EXT_WAKEUP_STATUS</name>
              <description>Radio wakeup by external source status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BLE_WKUP_STATUS</name>
              <description>RFMC BLE Wakeup status (Host Controlled)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAN_WKUP_STATUS</name>
              <description>RFMC MAN Wakeup status (Host Controlled)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WOR_WKUP_STATUS</name>
              <description>RFMC WOR Wakeup status (Host Controlled)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RF_CMC_BLE_WKUP_STATUS</name>
              <description>RF_CMC BLE Wakeup status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
